Repository: Rawan806/2025_GP_18
Catalog: lib/l10n/app_*.arb
Languages: ar

# tagline
source: Where deposits are kept and trusts are returned.
ar: حيث تُصان الودائع وتُرد الأمانات.

source: Sign in
ar: تسجيل الدخول

source: Email
ar: البريد الإلكتروني

source: Password
ar: كلمة المرور

source: Login
ar: دخول

# noAccount
source: Don't have an account? Sign up
ar: ليس لديك حساب؟ سجل الآن

# reportLost
source: Report a lost item
ar: الإبلاغ عن مفقود

# trackReport
source: Track a report
ar: متابعة بلاغ

# lostFormTitle
source: Report Form
ar: نموذج الإبلاغ

# dateTime
source: Date & time of loss *
ar: تاريخ ووقت الفقدان *

# itemName
source: Lost item name *
ar: اسم الغرض المفقود *

source: Attach photos
ar: إرفاق صور للغرض

# tipText
source: Tip: To help find your item, attach an old photo if available, or search for a similar image online and attach it.
ar: ملاحظة: للمساعدة في العثور على الغرض المفقود، يُفضّل إرفاق صورة قديمة إن وُجدت، أو البحث عن صورة مشابهة من الإنترنت وإرفاقها.

# extraDesc
source: Additional description (optional)
ar: وصف إضافي (اختياري)

source: Submit
ar: إرسال البلاغ

source: Account
ar: الحساب

source: Contact us
ar: تواصل معنا

source: Log out
ar: تسجيل خروج

# staffLoginTitle
source: Staff Login
ar: تسجيل دخول الموظف

source: Staff ID
ar: رقم الموظف (ID)

# enterStaffId
source: Please enter staff ID
ar: الرجاء إدخال رقم الموظف

# enterPassword
source: Please enter password
ar: الرجاء إدخال كلمة المرور

source: Back
ar: رجوع

source: Staff Home
ar: الرئيسية - الموظف

source: Match Report
ar: مطابقة بلاغ

source: Search Reports
ar: بحث في البلاغات

source: Latest Reports
ar: أحدث البلاغات

source: Report Number
ar: رقم البلاغ

source: Lost Item
ar: العنصر المفقود

source: Status
ar: الحالة

source: Date
ar: التاريخ

source: Register Found Item
ar: تسجيل عنصر مفقود تم العثور عليه

source: Re-run AI
ar: إعادة تشغيل الذكاء الاصطناعي

source: No image selected
ar: لم يتم اختيار صورة

source: Camera
ar: الكاميرا

source: Gallery
ar: المعرض

source: Suggested types:
ar: الأنواع المقترحة:

source: Suggested color:
ar: اللون المقترح:

# itemType
source: Item type (e.g., wallet, phone)
ar: نوع العنصر (مثل: محفظة، هاتف)

source: Color
ar: اللون

# description
source: Description / distinctive marks
ar: الوصف / علامات مميزة

# foundLocation
source: Found location (area/desk)
ar: موقع العثور (المنطقة/المكتب)

# storageLocation
source: Storage location (office shelf/bin)
ar: موقع التخزين (رف المكتب/الصندوق)

source: Found time
ar: وقت العثور

source: Save
ar: حفظ

# pleaseAddPhoto
source: Please add a photo
ar: الرجاء إضافة صورة

# typeColorLocationRequired
source: Type/Color/Location are required
ar: النوع/اللون/الموقع مطلوبة

source: Saved successfully
ar: تم الحفظ بنجاح

source: Save failed
ar: فشل الحفظ

# reportDetailsTitle
source: Report Details
ar: تفاصيل البلاغ

source: Type
ar: النوع

source: Report Location
ar: موقع الإبلاغ

source: Created At
ar: تاريخ الإنشاء

source: Updated At
ar: آخر تحديث

source: Report Status
ar: حالة البلاغ

source: Pending
ar: قيد الانتظار

source: Under Review
ar: قيد المراجعة

source: Matched
ar: مطابق

source: Closed
ar: مغلقة

source: Request Additional Evidence
ar: طلب أدلة إضافية

source: Staff Notes (Internal)
ar: ملاحظات الموظف (داخلية)

# writeNotesPlaceholder
source: Write any internal notes about the report...
ar: اكتب أي ملاحظات داخلية عن البلاغ أو المراجع...

source: Save Notes
ar: حفظ الملاحظات

source: Confirm Delivery with PIN
ar: تأكيد التسليم بالـ PIN

# searchByNameOrNumber
source: Search by name or report number
ar: ابحث بالاسم أو رقم البلاغ

source: All Statuses
ar: كل الحالات

source: Preliminary Match
ar: مطابقة مبدئية

source: No matching results.
ar: لا توجد نتائج مطابقة.

source: Item
ar: العنصر
